Tekla.Structures.CatalogInternal.ConflictHandler.dotFinalizeImportProfilesFromFolderWithoutSave
Finalizes the import of profile items from a folder to the profile catalog.
No save point is created as to facilitate a later savepoint rollback.
Returns: True if the import is successful; otherwise, false.